<?php
// Heading
$_['heading_title']          = 'Конфігурація';

// Text
$_['text_step_3'] 			 = 'Підключення до бази даних та налаштування адміністрування магазину';
$_['text_db_connection'] 	 = '1. Вкажіть відомості для зв\'язку з базою даних.';
$_['text_db_administration'] = '2. Вкажіть Логін, Пароль та E-Mail для адміністрування Вашого магазину.';
$_['text_mysqli'] 			 = 'MySQLi';
$_['text_mysql'] 			 = 'MySQL';
$_['text_mpdo'] 			 = 'mPDO';
$_['text_help'] 			 = 'Інформація про налаштування баз даних на різних платформах:';
$_['text_cpanel'] 			 = 'Налаштування БД у CPanel';
$_['text_plesk'] 			 = 'Налаштування БД у Plesk';

// Entry
$_['entry_db_driver'] 		 = 'Драйвер БД';
$_['entry_db_hostname'] 	 = 'Хост БД';
$_['entry_db_username'] 	 = 'Користувач БД';
$_['entry_db_password']  	 = 'Пароль БД';
$_['entry_db_database'] 	 = 'Ім\'я БД';
$_['entry_db_port'] 		 = 'Порт БД';
$_['entry_db_prefix'] 		 = 'Префікс таблиць БД';
$_['entry_username'] 		 = 'Логін';
$_['entry_password'] 		 = 'Пароль';
$_['entry_email'] 			 = 'E-Mail';

// Error
$_['error_db_driver'] 		 = 'Вкажіть Драйвер БД!';
$_['error_db_hostname'] 	 = 'Вкажіть Хост БД!';
$_['error_db_username'] 	 = 'Вкажіть Ім\'я Користувача!';
$_['error_db_database'] 	 = 'Вкажіть Ім\'я БД!';
$_['error_db_port'] 		 = 'Потрібен Порт бази даних!';
$_['error_db_prefix'] 	 	 = 'DB Префікс може містити лише маленькі літери в діапазоні a-z, цифри 0-9 та підкреслення';
$_['error_db_connect'] 		 = 'Не вдалося підключитися до бази даних, будь ласка, переконайтеся, що сервер бази даних, ім\'я користувача та пароль вказані правильно!';
$_['error_username'] 		 = 'Вкажіть Ім\'я Користувача!';
$_['error_password'] 		 = 'Вкажіть Пароль!';
$_['error_email'] 			 = 'Неправильний E-Mail!';
$_['error_config'] 			 = 'Не вдалося записати в config.php, будь ласка, перевірте права на запис повинні бути 777: ';
